app/controllers/blogposts_controller.rb

SELECT "blogposts".* FROM "blogposts"
---
  def index
    @blogposts = Blogpost.all

INSERT INTO "blogposts" ("content", "user_id", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @blogpost = Blogpost.new(blogpost_params)

    respond_to do |format|
      if @blogpost.save

SELECT  "blogposts".* FROM "blogposts" WHERE "blogposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_blogpost
      @blogpost = Blogpost.find(params[:id])