app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "password_digest") VALUES (?, ?, ?)  [["created_at", "2017-12-09 18:56:24.398903"], ["updated_at", "2017-12-09 18:56:24.398903"], ["password_digest", "$2a$10$CKd5hfks/.hI3/PlC69pROwEdbVn2JQZg8zGBE0mBCF3DIRddsY1."]]